netify-soap/src/test/resources/soap/requests/genre/AddGenreRequestTest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gen="http://mouthaan.org/namespace/netify/general"
                  xmlns:gen1="http://mouthaan.org/namespace/netify/datatypes/genre">
    <soapenv:Header/>
    <soapenv:Body>
        <gen:AddGenreRequest>
            <gen:genre>
                <gen1:name>Adventure II</gen1:name>
            </gen:genre>
        </gen:AddGenreRequest>
    </soapenv:Body>
</soapenv:Envelope>